[
    {
        "url": "https://www.businessinsider.com/15-most-promising-ai-powered-fintech-startups-according-top-vcs-2024-11",
        "content": "FINANCE\n15 up-and-coming AI-powered fintech startups, according to top VCs\nBianca Chan and Michelle Abrego Nov 29, 2024, 5:32 PM GMT+7\nShare\nSave\nIris Finance's Intel Chen; Brico's Snigdha Kumar; Materia AI's Lucas Adams; Clerkie's Guy Assad Iris Finance; Brico; Materia AI; Clerkie\nAdvertisement\nBusiness Insider asked 27 venture-capital investors to nominate the most promising fintechs.\nFintechs using AI to help Wall Street firms, bankers, and consumers lead this year's series.\nHere are the top 15 AI fintechs, according to VCs.\n\nFintech investors still see at least one bright spot in the industry, despite funding to the sector hitting one of its lowest points since the pandemic.\n\nTotal funding to fintechs fell once again last quarter, according to CB Insights' third-quarter data. Only 753 deals were inked, notching the lowest quarterly level since 2017.\n\nAdvertisement\n\nHowever, the dealmaking drought could ease up in the next year as a result of antitrust scrutiny softening and VCs might be more willing to open up their pocketbooks. One area that investors will likely hone in on once they do is AI.\n\nEarlier this year, Business Insider asked dozens of VCs to identify the most promising fintechs to watch. Nearly one-quarter of the startups they named are leveraging AI as a key part of their offering. Indeed, it is difficult to point to one area of finance where AI startups aren't threatening to change the way people bank, invest, save, and work.\n\nSome of the startups on this list are business-facing, helping dealmakers negotiate debt agreements, streamlining tedious processes for junior bankers, or automating manual processes for accountants and CFOs. Others use AI to serve consumers, whether it's helping them figure out the best way to pay off debts or maintaining access to healthcare between jobs.\n\nAdvertisement\n\nThe startups named haven't raised beyond a Series C and include a mix of investors' portfolio companies and ones they have no financial interest in.\n\nHere are 15 of the most promising AI fintechs to watch, according to top VCs.\n\nAdvertisement\nBeatBread\nBeatBread cofounders, Peter Sinclair, CEO, and John Haller, COO and chief data scientist. BeatBread\n\nCited by: Deciens Capital (investor)\n\nTotal raised: More than $150 million\n\nWhat it does: BeatBread uses AI to analyze and predict revenue potential for the music industry, providing funding advances to a broad range of artists.\n\nWhy it's on the list: \"Artists of all sizes want independence and ownership over their music, to work with their preferred partners, and to control their own destinies. Historically, there hasn't been a real alternative to the major label advance for artists to get the capital they needed to scale their careers, which locks them into the label ecosystem,\" Dan Kimerling, the managing partner at Deciens Capital, said.\n\n\"2024 has been a pivotal year for BeatBread, marked by strategic moves and partnerships that further solidify its mission,\" Kimerling said, referring to its partnerships with the administrative publishing company Kobalt and its subsidiary AMRA to offer artists increased royalties and faster payments. Other strategic moves include a series of deals providing funding to independent labels to expand how BeatBread provides capital to artists.\n\nAdvertisement\nBrico\nBrico cofounders Edward Swiac and Snigdha Kumar. Brico\n\nCited by: TTV Capital, Homebrew\n\nTotal funding: $8.1 million\n\nWhat it does: Brico helps financial institutions and fintechs manage their licensing by using AI to automate applications and renewals.\n\nWhy it's on the list: \"With Brico, businesses can effortlessly navigate the complexities of acquiring, renewing, and managing compliance for various financial licenses — including Credit, Money Transmitter, Mortgage Loan Originator, and more — in all 50 states,\" Lizzie Guynn, a partner at TTV Capital, said. \"Brico makes regulatory compliance seamless and cost-effective with its user-friendly tools that reduce time and money spent on financial licenses.\"\n\n\"It's addressing a very manual and expensive process that nearly every financial services company needs to deal with on an annual basis,\" Satya Patel, a partner at Homebrew, said.\n\nAdvertisement\nCascading AI\nCascading AI cofounders Isaiah Williams, CTO, and Lukas Haffer, CEO. Cascading AI\n\nCited by: QED Investors, Vesey Ventures\n\nTotal raised: $4.1 million\n\nWhat it does: Cascading AI, through its main product Casca, offers loan-origination software for the banking sector with an integrated AI assistant that allows firms to extend their hours.\n\nWhy it's on the list: \"Customers do not operate on the 9-to-5, Monday-to-Friday schedules that banks do,\" Laura Bock, a partner at QED Investors, said. \"When a pizzeria's oven breaks, the owner is inquiring about a loan after closing shop. While today, it might take nearly three days to hear back from a loan officer after submitting an application, financial institutions using Casca's AI platform are able to unlock 24/7, 365 support for current and potential customers.\"\n\nDana Eli-Lorch, a founding partner at Vesey Ventures, said: \"Their flagship product, an AI-powered loan assistant, enables manifold increases to banks' productivity and loan conversion rates, all while enhancing both accuracy and applicant experience. Casca exemplifies the powerful impact AI can have on financial services, driving significant operational efficiency and customer satisfaction.\"\n\nAdvertisement\nClerkie\nClerkie's Guy Assad, CEO, and Sebastian Wigstrom. Clerkie\n\nCited by: Flourish Ventures (investor)\n\nTotal raised: $41 million\n\nWhat it does: Clerkie embeds its AI debt-automation software in financial institutions' mobile apps, allowing consumers to make financial decisions about their debts and discover solutions if they're struggling to pay them off.\n\nWhy it's on the list: \"Clerkie's data flywheel and network create a win-win scenario for both consumers and financial institutions. Consumers enjoy a seamless experience within their banking app, with flexible solutions tailored to their specific cash flow needs, helping them avoid the collections process and protect their credit scores. Banks benefit from direct ROI through loan repayment while maintaining customer relationships,\" while also expanding loan-to-value ratios, Flourish Ventures' Emmalyn Shaw said.\n\nShe added that \"Clerkie assumes no balance-sheet risk, serving as the debt-network and debt-payment infrastructure for financial institutions.\"\n\nAdvertisement\nComulate\nComulate cofounders Jordan Katz, CEO, and Michael Mattheakis, CTO. Comulate\n\nCited by: Pathlight Ventures (formerly Exponent Founders Capital)\n\nTotal raised: About $5 million\n\nWhat it does: Comulate automates insurance statement processing, reconciliation, revenue recovery, and forecasting.\n\nWhy it's on the list: \"Leveraging AI to drive real revenue lift for insurance carriers is driving success in a category\" that's historically been hard to break into, Charley Ma, a cofounder and managing partner of Pathlight Ventures, said.\n\nAdvertisement\nCoris\nCoris cofounders Shyam Maddali, CTO, and Vinodh Poyyapakkam, CEO. Coris\n\nCited by: Pathlight Ventures (investor)\n\nTotal raised: $3.7 million\n\nWhat it does: Coris builds software for fintechs and other tech companies to manage risk and fraud among small- and medium-size business clients.\n\nWhy it's on the list: \"Aggregating unstructured data on SMBs to generate insights at scale is challenging. Coris is at the forefront, leveraging a variety of methods across LLMs, ML, and good old-fashioned software to establish itself as the leading platform for managing SMB risk and fraud — already working with clients like Mindbody and ClassPass,\" Pathlight's Ma said.\n\nAdvertisement\nFintary\nFintary founder Qiyun Cai. Fintary\n\nCited by: Harlem Capital (investor)\n\nTotal raised: $2.5 million\n\nWhat it does: Fintary helps insurance companies manage their finance and accounting needs by using AI to automate workflows.\n\nWhy it's on the list: \"They have been invited to their customers' conferences in order to share the product with their customers' customers,\" Henri Pierre-Jacques, the cofounder and managing partner of Harlem Capital, said. He said Fintary has grown more than 10 times since Harlem's investment last fall, adding that \"the quick ramp has been one of the fastest we've seen for a preseed company.\"\n\nAdvertisement\nGreenlite\nGreenlite cofounders Will Lawrence and Alex Jin. Greenlite\n\nCited by: Greylock (investor)\n\nTotal raised: $4.8 million\n\nWhat it does: Greenlite automates compliance processes using AI for fintechs and banks.\n\nWhy it's on the list: \"Greenlite has seen exceptional customer demands with enterprise banks and fintechs and has proven one of the few enterprise-grade applications for generative AI — automating tedious compliance workflows like alert handling, periodic reviews, and document processing, improving efficiency and reducing human error,\" Seth Rosenberg, a general partner at Greylock, said.\n\nAdvertisement\nIris Finance\nIris Finance cofounders Alex Heckmann, Drew Fallon, and Intel Chen. Iris Finance\n\nCited by: Redpoint Ventures\n\nTotal raised: $3.5 million\n\nWhat it does: Iris Finance offers consumer-facing companies AI-powered financial planning and analysis software.\n\nWhy it's on the list: \"While the notion of AI bookkeeping is very much in vogue today, replacing Quickbooks is hard — and not something most brands or outsourced accountants are looking to do in the near term,\" Redpoint's Clark said. \"Iris, instead, complements Quickbooks with a more holistic AI-powered CFO-in-a-box for brands, enabling them to seamlessly track and improve day-to-day sales and margin performance across channels, which much more closely aligns with what founders want and how modern brands are managed.\"\n\nAdvertisement\nMateria AI\nMateria AI cofounders Kevin Merlini and Lucas Adams Materia AI\n\nCited by: Bain Capital Ventures\n\nTotal raised: $6.3 million\n\nWhat it does: Materia AI helps accountants organize their data, enabling them to automate parts of their work.\n\nWhy it's on the list: \"With a decline in new auditors and an immense volume of manual data entry, professional-service audits are the perfect place for an AI copilot,\" Alysaa Co, principal at Bain Capital Ventures, said. \"LLMs enable the automation of work like ingesting large sets of unstructured financial data, searchability, comparing against historicals and across the industry, and direct citations for where the data comes from.\"\n\nAdvertisement\nNilus\nNilus cofounders Daniel Kalish and Danielle Shaul. Adi Eckstein\n\nCited by: Vesey Ventures (investor)\n\nTotal raised: $8.6 million\n\nWhat it does: Nilus offers an AI-powered cash and treasury management platform for fintechs, financial firms, marketplaces, and other companies moving money.\n\nWhy it's on the list: Nilus \"provides better data connectivity combined with AI to transform the CFO suite: a trend we are actively investing behind,\" Lindsay Fitzgerald, a general partner and the cofounder of Vesey Ventures, said.\n\n\"With Nilus, treasurers can skip the manual reconciliation work that previously took most of their day and focus on actions that can drive bottom-line impact. We think Nilus is poised to become the default software for modern treasury teams, displacing decades-old workflow tools like Kyriba and GTreasury,\" she said.\n\nAdvertisement\nNoetica\nNoetica AI cofounders Dan Wertman, Tom Effland, and Yoni Sebag. Noetica AI\n\nCited by: Avid Ventures, Index Ventures\n\nTotal raised: $7.85 million\n\nWhat it does: Noetica helps deal professionals negotiate debit agreements with their data using an AI platform that benchmarks terms in corporate debt transactions.\n\nWhy it's on the list: \"Noetica is a capital-markets data company for corporate debt, a market valued at trillions of dollars. Its AI-powered software allows professionals to upload any credit or bond document and compare all terms to similar public and private deals,\" Jahanvi Sardana, a partner at Index Ventures, said.\n\n\"Corporate debt terms are time-consuming and difficult to benchmark, leading deal professionals, such as lawyers and investment managers, to often miss higher-risk terms, as well as opportunities for negotiation. By building the largest proprietary dataset of corporate debt terms, Noetica is changing how these deals are negotiated and transacted,\" Tali Miller, a founding investor at Avid Ventures, said.\n\nAdvertisement\nNovella\nNovella founder and CEO Max Kane. Novella\n\nCited by: Avid Ventures (investor)\n\nTotal raised: $2.5 million\n\nWhat it does: Novella is an AI-powered insurance wholesaler specializing in excess and surplus insurance, which addresses higher-risk situations that standard carriers don't usually cover.\n\nWhy it's on the list: \"Given the complexity of E&S insurance, it is sold through wholesalers who have relationships with specialty carriers, and retail brokers must work with these wholesalers to access these carriers. However, brokers have been frustrated by the leading wholesalers such as Ryan Specialty, Amwins, and CRC Group, whose lack of technology and system integrations lead to slow, inefficient, and opaque quoting processes,\" Avid Ventures' Miller said.\n\n\"The E&S market continues to grow,\" Miller said, adding that E&S direct premiums written in the US climbed to more than $86 billion in 2023, more than doubling since 2018.\n\n\"Using data and AI, Novella aims to reinvent this massive industry by making the information transfer between brokers and carriers fast and error-free and, ultimately, automating quote creation,\" she added.\n\nAdvertisement\nRogo\nRogo cofounders Tumas Rackaitis (CTO), Gabriel Stengel (CEO) and John Willett (President). Rogo\n\nCited by: Two Sigma Ventures\n\nTotal raised: $26 million\n\nWhat it does: Rogo is building a generative AI assistant to help investment bankers and analysts do their jobs more efficiently.\n\nWhy it's on the list: \"Rogo's platform is purpose-built for the complex data needs of the financial sector, allowing nontechnical users to query vast amounts of financial data using natural language processing. This is a game changer for institutions like banks, investment firms, and insurers,\" Frances Schwiep, a partner at Two Sigma Ventures, said.\n\n\"I see immense potential in Rogo's ability to give first-of-its-kind access to critical financial analytics, positioning them as a key player in transforming how financial institutions interact with their data to drive more informed decisions across the industry,\" she added.\n\nSee the pitch deck for Rogo's $7 million seed.\n\nAdvertisement\nWhen\nWhen cofounder and CEO Andy Hamilton. When\n\nCited by: TTV Capital (investor)\n\nTotal raised: $7 million\n\nWhat it does: When uses an AI assistant to help exiting employees maintain access to healthcare by providing affordable alternatives to COBRA and making it easy to compare pricing and deductibles.\n\nWhy it's on the list: \"There are more than 700,000 companies in the United States with 20-plus employees, which means they are required by law to offer COBRA. Last year's 721,677 planned job cuts brought some of the largest reductions in company head count that we've seen in the past two decades,\" TTV Capital's Guynn said.\n\n\"Offering an alternative to expensive, inflexible COBRA not only makes common sense but also economic sense. COBRA participants are three times more costly than active employees, which is especially burdensome for self-insured companies. To date, companies that offer When's fixed-dollar health-insurance premium reimbursement have seen an 80% conversion rate from COBRA. Employees that applied their When benefit to available plans have saved as much as 50% in out-of-pocket healthcare costs,\" Guynn said.\n\nRead next\nFintech\nAI\nGenerative AI\nMore..."
    }
]